## Relational Databases

- What is it?
- Why use it?
- Modeling structure: ER diagrams
- Postgres setup and basic syntax

In [2]:
%load_ext sql
# you can model in lucidchart
# https://lucid.app/documents#/dashboard?folder_id=home
# https://docs.google.com/presentation/d/1JYqnS-6D_EjYja8sPK9hrZqttsxVm27BYXQgkshBSz8/edit#slide=id.g73d262f796_0_52
# https://www.databasestar.com/entity-relationship-diagram/

In [3]:
%sql postgres://jovyan:si330studentuser@localhost:5432/si330

'Connected: jovyan@si330'

In [4]:
# it is common to format your sql statements over multiple lines, and in jupyter we can do 
# this with the sql cell magic (starts with %%)

In [5]:
%%sql  #%%treats entire cell as sql
CREATE TABLE "item" (
    "price" float,
    "name" varchar(255),
    "description" varchar(4096),
    "company_id" integer
);   # ; needed to show end of command

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.SyntaxError) syntax error at or near "#%%"
LINE 1: #%%treats entire cell as sql
        ^

[SQL: #%%%%treats entire cell as sql
CREATE TABLE "item" (
    "price" float,
    "name" varchar(255),
    "description" varchar(4096),
    "company_id" integer
);   # ; needed to show end of command]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [6]:
%sql INSERT INTO item(price, name, description, company_id) values (2.0, 'omlette', 'it is tasty', 0);

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.UndefinedTable) relation "item" does not exist
LINE 1: INSERT INTO item(price, name, description, company_id) value...
                    ^

[SQL: INSERT INTO item(price, name, description, company_id) values (2.0, 'omlette', 'it is tasty', 0);]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [7]:
%%sql
select * from item #means get everything from item table

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.SyntaxError) syntax error at or near "#"
LINE 1: select * from item #means get everything from item table
                           ^

[SQL: select * from item #means get everything from item table]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [8]:
host="localhost"
dbname="si330"
user="jovyan"
password="si330studentuser"

In [9]:
import psycopg2
conn = psycopg2.connect(host=host, dbname=dbname, user=user, password=password)
conn.autocommit = True

In [10]:
try:
    cursor = conn.cursor()
    cursor.execute('''
        create table store(
            name varchar(255),
            branch_no integer,
            state varchar(2)
        );
    ''')
except psychopg2.DatabaseError as error:
    print(error)

In [11]:
try:
    cursor = conn.cursor()
    cursor.execute('''
        insert into store (name, branch_no, state) values ('Kroger', 5, 'MI');
    ''')
except psychopg2.DatabaseError as error:
    print(error)

In [12]:
import pandas as pd
pd.read_sql('SELECT * from store;', conn)

     name  branch_no state
0  Kroger          5    MI